Model: "efficient"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 224, 224, 3) 0
__________________________________________________________________________________________________
rescaling (Rescaling)           (None, 224, 224, 3)  0           input_1[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 224, 224, 3)  12          rescaling[0][0]
__________________________________________________________________________________________________
stem_conv_pad (ZeroPadding2D)   (None, 225, 225, 3)  0           batch_normalization[0][0]
__________________________________________________________________________________________________
stem_conv (Conv2D)              (None, 112, 112, 32) 864         stem_conv_pad[0][0]
__________________________________________________________________________________________________
stem_bn (BatchNormalization)    (None, 112, 112, 32) 128         stem_conv[0][0]
__________________________________________________________________________________________________
stem_activation (Activation)    (None, 112, 112, 32) 0           stem_bn[0][0]
__________________________________________________________________________________________________
block1a__dwconv (DepthwiseConv2 (None, 112, 112, 32) 288         stem_activation[0][0]
__________________________________________________________________________________________________
block1a__bn (BatchNormalization (None, 112, 112, 32) 128         block1a__dwconv[0][0]
__________________________________________________________________________________________________
block1a__activation (Activation (None, 112, 112, 32) 0           block1a__bn[0][0]
__________________________________________________________________________________________________
block1a__se_squeeze (GlobalAver (None, 32)           0           block1a__activation[0][0]
__________________________________________________________________________________________________
block1a__se_reshape (Reshape)   (None, 1, 1, 32)     0           block1a__se_squeeze[0][0]
__________________________________________________________________________________________________
block1a__se_reduce (Conv2D)     (None, 1, 1, 8)      264         block1a__se_reshape[0][0]
__________________________________________________________________________________________________
block1a__se_expand (Conv2D)     (None, 1, 1, 32)     288         block1a__se_reduce[0][0]
__________________________________________________________________________________________________
block1a__se_excite (Multiply)   (None, 112, 112, 32) 0           block1a__activation[0][0]
                                                                 block1a__se_expand[0][0]
__________________________________________________________________________________________________
block1a__project_conv (Conv2D)  (None, 112, 112, 16) 512         block1a__se_excite[0][0]
__________________________________________________________________________________________________
block1a__project_bn (BatchNorma (None, 112, 112, 16) 64          block1a__project_conv[0][0]
__________________________________________________________________________________________________
block2a__expand_conv (Conv2D)   (None, 112, 112, 96) 1536        block1a__project_bn[0][0]
__________________________________________________________________________________________________
block2a__expand_bn (BatchNormal (None, 112, 112, 96) 384         block2a__expand_conv[0][0]
__________________________________________________________________________________________________
block2a__expand_activation (Act (None, 112, 112, 96) 0           block2a__expand_bn[0][0]
__________________________________________________________________________________________________
block2a__dwconv_pad (ZeroPaddin (None, 113, 113, 96) 0           block2a__expand_activation[0][0]
__________________________________________________________________________________________________
block2a__dwconv (DepthwiseConv2 (None, 56, 56, 96)   864         block2a__dwconv_pad[0][0]
__________________________________________________________________________________________________
block2a__bn (BatchNormalization (None, 56, 56, 96)   384         block2a__dwconv[0][0]
__________________________________________________________________________________________________
block2a__activation (Activation (None, 56, 56, 96)   0           block2a__bn[0][0]
__________________________________________________________________________________________________
block2a__se_squeeze (GlobalAver (None, 96)           0           block2a__activation[0][0]
__________________________________________________________________________________________________
block2a__se_reshape (Reshape)   (None, 1, 1, 96)     0           block2a__se_squeeze[0][0]
__________________________________________________________________________________________________
block2a__se_reduce (Conv2D)     (None, 1, 1, 4)      388         block2a__se_reshape[0][0]
__________________________________________________________________________________________________
block2a__se_expand (Conv2D)     (None, 1, 1, 96)     480         block2a__se_reduce[0][0]
__________________________________________________________________________________________________
block2a__se_excite (Multiply)   (None, 56, 56, 96)   0           block2a__activation[0][0]
                                                                 block2a__se_expand[0][0]
__________________________________________________________________________________________________
block2a__project_conv (Conv2D)  (None, 56, 56, 24)   2304        block2a__se_excite[0][0]
__________________________________________________________________________________________________
block2a__project_bn (BatchNorma (None, 56, 56, 24)   96          block2a__project_conv[0][0]
__________________________________________________________________________________________________
block2b__expand_conv (Conv2D)   (None, 56, 56, 144)  3456        block2a__project_bn[0][0]
__________________________________________________________________________________________________
block2b__expand_bn (BatchNormal (None, 56, 56, 144)  576         block2b__expand_conv[0][0]
__________________________________________________________________________________________________
block2b__expand_activation (Act (None, 56, 56, 144)  0           block2b__expand_bn[0][0]
__________________________________________________________________________________________________
block2b__dwconv (DepthwiseConv2 (None, 56, 56, 144)  1296        block2b__expand_activation[0][0]
__________________________________________________________________________________________________
block2b__bn (BatchNormalization (None, 56, 56, 144)  576         block2b__dwconv[0][0]
__________________________________________________________________________________________________
block2b__activation (Activation (None, 56, 56, 144)  0           block2b__bn[0][0]
__________________________________________________________________________________________________
block2b__se_squeeze (GlobalAver (None, 144)          0           block2b__activation[0][0]
__________________________________________________________________________________________________
block2b__se_reshape (Reshape)   (None, 1, 1, 144)    0           block2b__se_squeeze[0][0]
__________________________________________________________________________________________________
block2b__se_reduce (Conv2D)     (None, 1, 1, 6)      870         block2b__se_reshape[0][0]
__________________________________________________________________________________________________
block2b__se_expand (Conv2D)     (None, 1, 1, 144)    1008        block2b__se_reduce[0][0]
__________________________________________________________________________________________________
block2b__se_excite (Multiply)   (None, 56, 56, 144)  0           block2b__activation[0][0]
                                                                 block2b__se_expand[0][0]
__________________________________________________________________________________________________
block2b__project_conv (Conv2D)  (None, 56, 56, 24)   3456        block2b__se_excite[0][0]
__________________________________________________________________________________________________
block2b__project_bn (BatchNorma (None, 56, 56, 24)   96          block2b__project_conv[0][0]
__________________________________________________________________________________________________
block2b__drop (Dropout)         (None, 56, 56, 24)   0           block2b__project_bn[0][0]
__________________________________________________________________________________________________
block2b__add (Add)              (None, 56, 56, 24)   0           block2b__drop[0][0]
                                                                 block2a__project_bn[0][0]
__________________________________________________________________________________________________
block3a__expand_conv (Conv2D)   (None, 56, 56, 144)  3456        block2b__add[0][0]
__________________________________________________________________________________________________
block3a__expand_bn (BatchNormal (None, 56, 56, 144)  576         block3a__expand_conv[0][0]
__________________________________________________________________________________________________
block3a__expand_activation (Act (None, 56, 56, 144)  0           block3a__expand_bn[0][0]
__________________________________________________________________________________________________
block3a__dwconv_pad (ZeroPaddin (None, 59, 59, 144)  0           block3a__expand_activation[0][0]
__________________________________________________________________________________________________
block3a__dwconv (DepthwiseConv2 (None, 28, 28, 144)  3600        block3a__dwconv_pad[0][0]
__________________________________________________________________________________________________
block3a__bn (BatchNormalization (None, 28, 28, 144)  576         block3a__dwconv[0][0]
__________________________________________________________________________________________________
block3a__activation (Activation (None, 28, 28, 144)  0           block3a__bn[0][0]
__________________________________________________________________________________________________
block3a__se_squeeze (GlobalAver (None, 144)          0           block3a__activation[0][0]
__________________________________________________________________________________________________
block3a__se_reshape (Reshape)   (None, 1, 1, 144)    0           block3a__se_squeeze[0][0]
__________________________________________________________________________________________________
block3a__se_reduce (Conv2D)     (None, 1, 1, 6)      870         block3a__se_reshape[0][0]
__________________________________________________________________________________________________
block3a__se_expand (Conv2D)     (None, 1, 1, 144)    1008        block3a__se_reduce[0][0]
__________________________________________________________________________________________________
block3a__se_excite (Multiply)   (None, 28, 28, 144)  0           block3a__activation[0][0]
                                                                 block3a__se_expand[0][0]
__________________________________________________________________________________________________
block3a__project_conv (Conv2D)  (None, 28, 28, 40)   5760        block3a__se_excite[0][0]
__________________________________________________________________________________________________
block3a__project_bn (BatchNorma (None, 28, 28, 40)   160         block3a__project_conv[0][0]
__________________________________________________________________________________________________
block3b__expand_conv (Conv2D)   (None, 28, 28, 240)  9600        block3a__project_bn[0][0]
__________________________________________________________________________________________________
block3b__expand_bn (BatchNormal (None, 28, 28, 240)  960         block3b__expand_conv[0][0]
__________________________________________________________________________________________________
block3b__expand_activation (Act (None, 28, 28, 240)  0           block3b__expand_bn[0][0]
__________________________________________________________________________________________________
block3b__dwconv (DepthwiseConv2 (None, 28, 28, 240)  6000        block3b__expand_activation[0][0]
__________________________________________________________________________________________________
block3b__bn (BatchNormalization (None, 28, 28, 240)  960         block3b__dwconv[0][0]
__________________________________________________________________________________________________
block3b__activation (Activation (None, 28, 28, 240)  0           block3b__bn[0][0]
__________________________________________________________________________________________________
block3b__se_squeeze (GlobalAver (None, 240)          0           block3b__activation[0][0]
__________________________________________________________________________________________________
block3b__se_reshape (Reshape)   (None, 1, 1, 240)    0           block3b__se_squeeze[0][0]
__________________________________________________________________________________________________
block3b__se_reduce (Conv2D)     (None, 1, 1, 10)     2410        block3b__se_reshape[0][0]
__________________________________________________________________________________________________
block3b__se_expand (Conv2D)     (None, 1, 1, 240)    2640        block3b__se_reduce[0][0]
__________________________________________________________________________________________________
block3b__se_excite (Multiply)   (None, 28, 28, 240)  0           block3b__activation[0][0]
                                                                 block3b__se_expand[0][0]
__________________________________________________________________________________________________
block3b__project_conv (Conv2D)  (None, 28, 28, 40)   9600        block3b__se_excite[0][0]
__________________________________________________________________________________________________
block3b__project_bn (BatchNorma (None, 28, 28, 40)   160         block3b__project_conv[0][0]
__________________________________________________________________________________________________
block3b__drop (Dropout)         (None, 28, 28, 40)   0           block3b__project_bn[0][0]
__________________________________________________________________________________________________
block3b__add (Add)              (None, 28, 28, 40)   0           block3b__drop[0][0]
                                                                 block3a__project_bn[0][0]
__________________________________________________________________________________________________
block4a__expand_conv (Conv2D)   (None, 28, 28, 240)  9600        block3b__add[0][0]
__________________________________________________________________________________________________
block4a__expand_bn (BatchNormal (None, 28, 28, 240)  960         block4a__expand_conv[0][0]
__________________________________________________________________________________________________
block4a__expand_activation (Act (None, 28, 28, 240)  0           block4a__expand_bn[0][0]
__________________________________________________________________________________________________
block4a__dwconv_pad (ZeroPaddin (None, 29, 29, 240)  0           block4a__expand_activation[0][0]
__________________________________________________________________________________________________
block4a__dwconv (DepthwiseConv2 (None, 14, 14, 240)  2160        block4a__dwconv_pad[0][0]
__________________________________________________________________________________________________
block4a__bn (BatchNormalization (None, 14, 14, 240)  960         block4a__dwconv[0][0]
__________________________________________________________________________________________________
block4a__activation (Activation (None, 14, 14, 240)  0           block4a__bn[0][0]
__________________________________________________________________________________________________
block4a__se_squeeze (GlobalAver (None, 240)          0           block4a__activation[0][0]
__________________________________________________________________________________________________
block4a__se_reshape (Reshape)   (None, 1, 1, 240)    0           block4a__se_squeeze[0][0]
__________________________________________________________________________________________________
block4a__se_reduce (Conv2D)     (None, 1, 1, 10)     2410        block4a__se_reshape[0][0]
__________________________________________________________________________________________________
block4a__se_expand (Conv2D)     (None, 1, 1, 240)    2640        block4a__se_reduce[0][0]
__________________________________________________________________________________________________
block4a__se_excite (Multiply)   (None, 14, 14, 240)  0           block4a__activation[0][0]
                                                                 block4a__se_expand[0][0]
__________________________________________________________________________________________________
block4a__project_conv (Conv2D)  (None, 14, 14, 80)   19200       block4a__se_excite[0][0]
__________________________________________________________________________________________________
block4a__project_bn (BatchNorma (None, 14, 14, 80)   320         block4a__project_conv[0][0]
__________________________________________________________________________________________________
block4b__expand_conv (Conv2D)   (None, 14, 14, 480)  38400       block4a__project_bn[0][0]
__________________________________________________________________________________________________
block4b__expand_bn (BatchNormal (None, 14, 14, 480)  1920        block4b__expand_conv[0][0]
__________________________________________________________________________________________________
block4b__expand_activation (Act (None, 14, 14, 480)  0           block4b__expand_bn[0][0]
__________________________________________________________________________________________________
block4b__dwconv (DepthwiseConv2 (None, 14, 14, 480)  4320        block4b__expand_activation[0][0]
__________________________________________________________________________________________________
block4b__bn (BatchNormalization (None, 14, 14, 480)  1920        block4b__dwconv[0][0]
__________________________________________________________________________________________________
block4b__activation (Activation (None, 14, 14, 480)  0           block4b__bn[0][0]
__________________________________________________________________________________________________
block4b__se_squeeze (GlobalAver (None, 480)          0           block4b__activation[0][0]
__________________________________________________________________________________________________
block4b__se_reshape (Reshape)   (None, 1, 1, 480)    0           block4b__se_squeeze[0][0]
__________________________________________________________________________________________________
block4b__se_reduce (Conv2D)     (None, 1, 1, 20)     9620        block4b__se_reshape[0][0]
__________________________________________________________________________________________________
block4b__se_expand (Conv2D)     (None, 1, 1, 480)    10080       block4b__se_reduce[0][0]
__________________________________________________________________________________________________
block4b__se_excite (Multiply)   (None, 14, 14, 480)  0           block4b__activation[0][0]
                                                                 block4b__se_expand[0][0]
__________________________________________________________________________________________________
block4b__project_conv (Conv2D)  (None, 14, 14, 80)   38400       block4b__se_excite[0][0]
__________________________________________________________________________________________________
block4b__project_bn (BatchNorma (None, 14, 14, 80)   320         block4b__project_conv[0][0]
__________________________________________________________________________________________________
block4b__drop (Dropout)         (None, 14, 14, 80)   0           block4b__project_bn[0][0]
__________________________________________________________________________________________________
block4b__add (Add)              (None, 14, 14, 80)   0           block4b__drop[0][0]
                                                                 block4a__project_bn[0][0]
__________________________________________________________________________________________________
block4c__expand_conv (Conv2D)   (None, 14, 14, 480)  38400       block4b__add[0][0]
__________________________________________________________________________________________________
block4c__expand_bn (BatchNormal (None, 14, 14, 480)  1920        block4c__expand_conv[0][0]
__________________________________________________________________________________________________
block4c__expand_activation (Act (None, 14, 14, 480)  0           block4c__expand_bn[0][0]
__________________________________________________________________________________________________
block4c__dwconv (DepthwiseConv2 (None, 14, 14, 480)  4320        block4c__expand_activation[0][0]
__________________________________________________________________________________________________
block4c__bn (BatchNormalization (None, 14, 14, 480)  1920        block4c__dwconv[0][0]
__________________________________________________________________________________________________
block4c__activation (Activation (None, 14, 14, 480)  0           block4c__bn[0][0]
__________________________________________________________________________________________________
block4c__se_squeeze (GlobalAver (None, 480)          0           block4c__activation[0][0]
__________________________________________________________________________________________________
block4c__se_reshape (Reshape)   (None, 1, 1, 480)    0           block4c__se_squeeze[0][0]
__________________________________________________________________________________________________
block4c__se_reduce (Conv2D)     (None, 1, 1, 20)     9620        block4c__se_reshape[0][0]
__________________________________________________________________________________________________
block4c__se_expand (Conv2D)     (None, 1, 1, 480)    10080       block4c__se_reduce[0][0]
__________________________________________________________________________________________________
block4c__se_excite (Multiply)   (None, 14, 14, 480)  0           block4c__activation[0][0]
                                                                 block4c__se_expand[0][0]
__________________________________________________________________________________________________
block4c__project_conv (Conv2D)  (None, 14, 14, 80)   38400       block4c__se_excite[0][0]
__________________________________________________________________________________________________
block4c__project_bn (BatchNorma (None, 14, 14, 80)   320         block4c__project_conv[0][0]
__________________________________________________________________________________________________
block4c__drop (Dropout)         (None, 14, 14, 80)   0           block4c__project_bn[0][0]
__________________________________________________________________________________________________
block4c__add (Add)              (None, 14, 14, 80)   0           block4c__drop[0][0]
                                                                 block4b__add[0][0]
__________________________________________________________________________________________________
block5a__expand_conv (Conv2D)   (None, 14, 14, 480)  38400       block4c__add[0][0]
__________________________________________________________________________________________________
block5a__expand_bn (BatchNormal (None, 14, 14, 480)  1920        block5a__expand_conv[0][0]
__________________________________________________________________________________________________
block5a__expand_activation (Act (None, 14, 14, 480)  0           block5a__expand_bn[0][0]
__________________________________________________________________________________________________
block5a__dwconv (DepthwiseConv2 (None, 14, 14, 480)  12000       block5a__expand_activation[0][0]
__________________________________________________________________________________________________
block5a__bn (BatchNormalization (None, 14, 14, 480)  1920        block5a__dwconv[0][0]
__________________________________________________________________________________________________
block5a__activation (Activation (None, 14, 14, 480)  0           block5a__bn[0][0]
__________________________________________________________________________________________________
block5a__se_squeeze (GlobalAver (None, 480)          0           block5a__activation[0][0]
__________________________________________________________________________________________________
block5a__se_reshape (Reshape)   (None, 1, 1, 480)    0           block5a__se_squeeze[0][0]
__________________________________________________________________________________________________
block5a__se_reduce (Conv2D)     (None, 1, 1, 20)     9620        block5a__se_reshape[0][0]
__________________________________________________________________________________________________
block5a__se_expand (Conv2D)     (None, 1, 1, 480)    10080       block5a__se_reduce[0][0]
__________________________________________________________________________________________________
block5a__se_excite (Multiply)   (None, 14, 14, 480)  0           block5a__activation[0][0]
                                                                 block5a__se_expand[0][0]
__________________________________________________________________________________________________
block5a__project_conv (Conv2D)  (None, 14, 14, 112)  53760       block5a__se_excite[0][0]
__________________________________________________________________________________________________
block5a__project_bn (BatchNorma (None, 14, 14, 112)  448         block5a__project_conv[0][0]
__________________________________________________________________________________________________
block5b__expand_conv (Conv2D)   (None, 14, 14, 672)  75264       block5a__project_bn[0][0]
__________________________________________________________________________________________________
block5b__expand_bn (BatchNormal (None, 14, 14, 672)  2688        block5b__expand_conv[0][0]
__________________________________________________________________________________________________
block5b__expand_activation (Act (None, 14, 14, 672)  0           block5b__expand_bn[0][0]
__________________________________________________________________________________________________
block5b__dwconv (DepthwiseConv2 (None, 14, 14, 672)  16800       block5b__expand_activation[0][0]
__________________________________________________________________________________________________
block5b__bn (BatchNormalization (None, 14, 14, 672)  2688        block5b__dwconv[0][0]
__________________________________________________________________________________________________
block5b__activation (Activation (None, 14, 14, 672)  0           block5b__bn[0][0]
__________________________________________________________________________________________________
block5b__se_squeeze (GlobalAver (None, 672)          0           block5b__activation[0][0]
__________________________________________________________________________________________________
block5b__se_reshape (Reshape)   (None, 1, 1, 672)    0           block5b__se_squeeze[0][0]
__________________________________________________________________________________________________
block5b__se_reduce (Conv2D)     (None, 1, 1, 28)     18844       block5b__se_reshape[0][0]
__________________________________________________________________________________________________
block5b__se_expand (Conv2D)     (None, 1, 1, 672)    19488       block5b__se_reduce[0][0]
__________________________________________________________________________________________________
block5b__se_excite (Multiply)   (None, 14, 14, 672)  0           block5b__activation[0][0]
                                                                 block5b__se_expand[0][0]
__________________________________________________________________________________________________
block5b__project_conv (Conv2D)  (None, 14, 14, 112)  75264       block5b__se_excite[0][0]
__________________________________________________________________________________________________
block5b__project_bn (BatchNorma (None, 14, 14, 112)  448         block5b__project_conv[0][0]
__________________________________________________________________________________________________
block5b__drop (Dropout)         (None, 14, 14, 112)  0           block5b__project_bn[0][0]
__________________________________________________________________________________________________
block5b__add (Add)              (None, 14, 14, 112)  0           block5b__drop[0][0]
                                                                 block5a__project_bn[0][0]
__________________________________________________________________________________________________
block5c__expand_conv (Conv2D)   (None, 14, 14, 672)  75264       block5b__add[0][0]
__________________________________________________________________________________________________
block5c__expand_bn (BatchNormal (None, 14, 14, 672)  2688        block5c__expand_conv[0][0]
__________________________________________________________________________________________________
block5c__expand_activation (Act (None, 14, 14, 672)  0           block5c__expand_bn[0][0]
__________________________________________________________________________________________________
block5c__dwconv (DepthwiseConv2 (None, 14, 14, 672)  16800       block5c__expand_activation[0][0]
__________________________________________________________________________________________________
block5c__bn (BatchNormalization (None, 14, 14, 672)  2688        block5c__dwconv[0][0]
__________________________________________________________________________________________________
block5c__activation (Activation (None, 14, 14, 672)  0           block5c__bn[0][0]
__________________________________________________________________________________________________
block5c__se_squeeze (GlobalAver (None, 672)          0           block5c__activation[0][0]
__________________________________________________________________________________________________
block5c__se_reshape (Reshape)   (None, 1, 1, 672)    0           block5c__se_squeeze[0][0]
__________________________________________________________________________________________________
block5c__se_reduce (Conv2D)     (None, 1, 1, 28)     18844       block5c__se_reshape[0][0]
__________________________________________________________________________________________________
block5c__se_expand (Conv2D)     (None, 1, 1, 672)    19488       block5c__se_reduce[0][0]
__________________________________________________________________________________________________
block5c__se_excite (Multiply)   (None, 14, 14, 672)  0           block5c__activation[0][0]
                                                                 block5c__se_expand[0][0]
__________________________________________________________________________________________________
block5c__project_conv (Conv2D)  (None, 14, 14, 112)  75264       block5c__se_excite[0][0]
__________________________________________________________________________________________________
block5c__project_bn (BatchNorma (None, 14, 14, 112)  448         block5c__project_conv[0][0]
__________________________________________________________________________________________________
block5c__drop (Dropout)         (None, 14, 14, 112)  0           block5c__project_bn[0][0]
__________________________________________________________________________________________________
block5c__add (Add)              (None, 14, 14, 112)  0           block5c__drop[0][0]
                                                                 block5b__add[0][0]
__________________________________________________________________________________________________
block6a__expand_conv (Conv2D)   (None, 14, 14, 672)  75264       block5c__add[0][0]
__________________________________________________________________________________________________
block6a__expand_bn (BatchNormal (None, 14, 14, 672)  2688        block6a__expand_conv[0][0]
__________________________________________________________________________________________________
block6a__expand_activation (Act (None, 14, 14, 672)  0           block6a__expand_bn[0][0]
__________________________________________________________________________________________________
block6a__dwconv_pad (ZeroPaddin (None, 17, 17, 672)  0           block6a__expand_activation[0][0]
__________________________________________________________________________________________________
block6a__dwconv (DepthwiseConv2 (None, 7, 7, 672)    16800       block6a__dwconv_pad[0][0]
__________________________________________________________________________________________________
block6a__bn (BatchNormalization (None, 7, 7, 672)    2688        block6a__dwconv[0][0]
__________________________________________________________________________________________________
block6a__activation (Activation (None, 7, 7, 672)    0           block6a__bn[0][0]
__________________________________________________________________________________________________
block6a__se_squeeze (GlobalAver (None, 672)          0           block6a__activation[0][0]
__________________________________________________________________________________________________
block6a__se_reshape (Reshape)   (None, 1, 1, 672)    0           block6a__se_squeeze[0][0]
__________________________________________________________________________________________________
block6a__se_reduce (Conv2D)     (None, 1, 1, 28)     18844       block6a__se_reshape[0][0]
__________________________________________________________________________________________________
block6a__se_expand (Conv2D)     (None, 1, 1, 672)    19488       block6a__se_reduce[0][0]
__________________________________________________________________________________________________
block6a__se_excite (Multiply)   (None, 7, 7, 672)    0           block6a__activation[0][0]
                                                                 block6a__se_expand[0][0]
__________________________________________________________________________________________________
block6a__project_conv (Conv2D)  (None, 7, 7, 192)    129024      block6a__se_excite[0][0]
__________________________________________________________________________________________________
block6a__project_bn (BatchNorma (None, 7, 7, 192)    768         block6a__project_conv[0][0]
__________________________________________________________________________________________________
block6b__expand_conv (Conv2D)   (None, 7, 7, 1152)   221184      block6a__project_bn[0][0]
__________________________________________________________________________________________________
block6b__expand_bn (BatchNormal (None, 7, 7, 1152)   4608        block6b__expand_conv[0][0]
__________________________________________________________________________________________________
block6b__expand_activation (Act (None, 7, 7, 1152)   0           block6b__expand_bn[0][0]
__________________________________________________________________________________________________
block6b__dwconv (DepthwiseConv2 (None, 7, 7, 1152)   28800       block6b__expand_activation[0][0]
__________________________________________________________________________________________________
block6b__bn (BatchNormalization (None, 7, 7, 1152)   4608        block6b__dwconv[0][0]
__________________________________________________________________________________________________
block6b__activation (Activation (None, 7, 7, 1152)   0           block6b__bn[0][0]
__________________________________________________________________________________________________
block6b__se_squeeze (GlobalAver (None, 1152)         0           block6b__activation[0][0]
__________________________________________________________________________________________________
block6b__se_reshape (Reshape)   (None, 1, 1, 1152)   0           block6b__se_squeeze[0][0]
__________________________________________________________________________________________________
block6b__se_reduce (Conv2D)     (None, 1, 1, 48)     55344       block6b__se_reshape[0][0]
__________________________________________________________________________________________________
block6b__se_expand (Conv2D)     (None, 1, 1, 1152)   56448       block6b__se_reduce[0][0]
__________________________________________________________________________________________________
block6b__se_excite (Multiply)   (None, 7, 7, 1152)   0           block6b__activation[0][0]
                                                                 block6b__se_expand[0][0]
__________________________________________________________________________________________________
block6b__project_conv (Conv2D)  (None, 7, 7, 192)    221184      block6b__se_excite[0][0]
__________________________________________________________________________________________________
block6b__project_bn (BatchNorma (None, 7, 7, 192)    768         block6b__project_conv[0][0]
__________________________________________________________________________________________________
block6b__drop (Dropout)         (None, 7, 7, 192)    0           block6b__project_bn[0][0]
__________________________________________________________________________________________________
block6b__add (Add)              (None, 7, 7, 192)    0           block6b__drop[0][0]
                                                                 block6a__project_bn[0][0]
__________________________________________________________________________________________________
block6c__expand_conv (Conv2D)   (None, 7, 7, 1152)   221184      block6b__add[0][0]
__________________________________________________________________________________________________
block6c__expand_bn (BatchNormal (None, 7, 7, 1152)   4608        block6c__expand_conv[0][0]
__________________________________________________________________________________________________
block6c__expand_activation (Act (None, 7, 7, 1152)   0           block6c__expand_bn[0][0]
__________________________________________________________________________________________________
block6c__dwconv (DepthwiseConv2 (None, 7, 7, 1152)   28800       block6c__expand_activation[0][0]
__________________________________________________________________________________________________
block6c__bn (BatchNormalization (None, 7, 7, 1152)   4608        block6c__dwconv[0][0]
__________________________________________________________________________________________________
block6c__activation (Activation (None, 7, 7, 1152)   0           block6c__bn[0][0]
__________________________________________________________________________________________________
block6c__se_squeeze (GlobalAver (None, 1152)         0           block6c__activation[0][0]
__________________________________________________________________________________________________
block6c__se_reshape (Reshape)   (None, 1, 1, 1152)   0           block6c__se_squeeze[0][0]
__________________________________________________________________________________________________
block6c__se_reduce (Conv2D)     (None, 1, 1, 48)     55344       block6c__se_reshape[0][0]
__________________________________________________________________________________________________
block6c__se_expand (Conv2D)     (None, 1, 1, 1152)   56448       block6c__se_reduce[0][0]
__________________________________________________________________________________________________
block6c__se_excite (Multiply)   (None, 7, 7, 1152)   0           block6c__activation[0][0]
                                                                 block6c__se_expand[0][0]
__________________________________________________________________________________________________
block6c__project_conv (Conv2D)  (None, 7, 7, 192)    221184      block6c__se_excite[0][0]
__________________________________________________________________________________________________
block6c__project_bn (BatchNorma (None, 7, 7, 192)    768         block6c__project_conv[0][0]
__________________________________________________________________________________________________
block6c__drop (Dropout)         (None, 7, 7, 192)    0           block6c__project_bn[0][0]
__________________________________________________________________________________________________
block6c__add (Add)              (None, 7, 7, 192)    0           block6c__drop[0][0]
                                                                 block6b__add[0][0]
__________________________________________________________________________________________________
block6d__expand_conv (Conv2D)   (None, 7, 7, 1152)   221184      block6c__add[0][0]
__________________________________________________________________________________________________
block6d__expand_bn (BatchNormal (None, 7, 7, 1152)   4608        block6d__expand_conv[0][0]
__________________________________________________________________________________________________
block6d__expand_activation (Act (None, 7, 7, 1152)   0           block6d__expand_bn[0][0]
__________________________________________________________________________________________________
block6d__dwconv (DepthwiseConv2 (None, 7, 7, 1152)   28800       block6d__expand_activation[0][0]
__________________________________________________________________________________________________
block6d__bn (BatchNormalization (None, 7, 7, 1152)   4608        block6d__dwconv[0][0]
__________________________________________________________________________________________________
block6d__activation (Activation (None, 7, 7, 1152)   0           block6d__bn[0][0]
__________________________________________________________________________________________________
block6d__se_squeeze (GlobalAver (None, 1152)         0           block6d__activation[0][0]
__________________________________________________________________________________________________
block6d__se_reshape (Reshape)   (None, 1, 1, 1152)   0           block6d__se_squeeze[0][0]
__________________________________________________________________________________________________
block6d__se_reduce (Conv2D)     (None, 1, 1, 48)     55344       block6d__se_reshape[0][0]
__________________________________________________________________________________________________
block6d__se_expand (Conv2D)     (None, 1, 1, 1152)   56448       block6d__se_reduce[0][0]
__________________________________________________________________________________________________
block6d__se_excite (Multiply)   (None, 7, 7, 1152)   0           block6d__activation[0][0]
                                                                 block6d__se_expand[0][0]
__________________________________________________________________________________________________
block6d__project_conv (Conv2D)  (None, 7, 7, 192)    221184      block6d__se_excite[0][0]
__________________________________________________________________________________________________
block6d__project_bn (BatchNorma (None, 7, 7, 192)    768         block6d__project_conv[0][0]
__________________________________________________________________________________________________
block6d__drop (Dropout)         (None, 7, 7, 192)    0           block6d__project_bn[0][0]
__________________________________________________________________________________________________
block6d__add (Add)              (None, 7, 7, 192)    0           block6d__drop[0][0]
                                                                 block6c__add[0][0]
__________________________________________________________________________________________________
block7a__expand_conv (Conv2D)   (None, 7, 7, 1152)   221184      block6d__add[0][0]
__________________________________________________________________________________________________
block7a__expand_bn (BatchNormal (None, 7, 7, 1152)   4608        block7a__expand_conv[0][0]
__________________________________________________________________________________________________
block7a__expand_activation (Act (None, 7, 7, 1152)   0           block7a__expand_bn[0][0]
__________________________________________________________________________________________________
block7a__dwconv (DepthwiseConv2 (None, 7, 7, 1152)   10368       block7a__expand_activation[0][0]
__________________________________________________________________________________________________
block7a__bn (BatchNormalization (None, 7, 7, 1152)   4608        block7a__dwconv[0][0]
__________________________________________________________________________________________________
block7a__activation (Activation (None, 7, 7, 1152)   0           block7a__bn[0][0]
__________________________________________________________________________________________________
block7a__se_squeeze (GlobalAver (None, 1152)         0           block7a__activation[0][0]
__________________________________________________________________________________________________
block7a__se_reshape (Reshape)   (None, 1, 1, 1152)   0           block7a__se_squeeze[0][0]
__________________________________________________________________________________________________
block7a__se_reduce (Conv2D)     (None, 1, 1, 48)     55344       block7a__se_reshape[0][0]
__________________________________________________________________________________________________
block7a__se_expand (Conv2D)     (None, 1, 1, 1152)   56448       block7a__se_reduce[0][0]
__________________________________________________________________________________________________
block7a__se_excite (Multiply)   (None, 7, 7, 1152)   0           block7a__activation[0][0]
                                                                 block7a__se_expand[0][0]
__________________________________________________________________________________________________
block7a__project_conv (Conv2D)  (None, 7, 7, 320)    368640      block7a__se_excite[0][0]
__________________________________________________________________________________________________
block7a__project_bn (BatchNorma (None, 7, 7, 320)    1280        block7a__project_conv[0][0]
__________________________________________________________________________________________________
top_conv (Conv2D)               (None, 7, 7, 1280)   409600      block7a__project_bn[0][0]
__________________________________________________________________________________________________
top_bn (BatchNormalization)     (None, 7, 7, 1280)   5120        top_conv[0][0]
__________________________________________________________________________________________________
top_activation (Activation)     (None, 7, 7, 1280)   0           top_bn[0][0]
__________________________________________________________________________________________________
avg_pool (GlobalAveragePooling2 (None, 1280)         0           top_activation[0][0]
__________________________________________________________________________________________________
top_dropout (Dropout)           (None, 1280)         0           avg_pool[0][0]
__________________________________________________________________________________________________
predictions (Dense)             (None, 1000)         1281000     top_dropout[0][0]
==================================================================================================
Total params: 5,330,576
Trainable params: 5,288,554
Non-trainable params: 42,022
__________________________________________________________________________________________________